# 1) Создать переменную типа String
a = "Hi"

# 2) Создать переменную типа Integer
b = 5

# 3) Создать переменную типа Float
c = 5.0

# 4) Создать переменную типа Bytes
d = b'Hanna'

# 5) Создать переменную типа List
e = ['Hanna', 'Oleg', 25, 46]

# 6) Создать переменную типа Tuple
f = (5, 'oleg', 4, 'Lena')

# 7) Создать переменную типа Set
g = {1, 3, 4, 5, 6}

# 8. Создать переменную типа Frozen set
k = frozenset([1, 3, 4, 5, 6])

# 9) Создать переменную типа Dict
e = {1:'value', 'key':2}

# 10) Вывести в консоль все выше перечисленные переменные с добавлением типа данных.
print('a:', a, type(a),
      'b:', b, type(b),
      'c:', c, type(c),
      'd:', d, type(d),
      'e:', e, type(e),
      'f:', f, type(f),
      'g:', g, type(g),
      'k:', k, type(k),
      'e:', e, type(e)
      )

# 11) Создать 2 переменные String, создать переменную в которой сканкатенируете эти переменные. Вывести в консоль.
name_1 = 'Oleg'
name_2 = 'Hanna'
print(name_1, name_2, sep='====')

# 12) Вывести в одну строку переменные типа String и Integer используя “,” (Запятую)
print('a =', a, 'b =', b)
# 13) Вывести в одну строку переменные типа String и Integer используя “+” (Плюс)
print('a =', a + ' b =', b)


# name = input('Input your name:')
# print('Hello,', name)
# name = "nadine"
# name_len = len(name)
# sorted_name = sorted(name)
# name_type = type(name)
#
# print('Name:', name, 'Len:', name_len)
# print('sorted_name:', sorted_name)
# print('name_type:', name_type)

name = 'Vadim'

username = 'Nadine'
n1ame = 'Alex'


